ezois_ka/oooezoiskaobmen/src/InformationRegisters/РегистрацииЗапросовСреднегоЗаработкаСЭДО/РегистрацииЗапросовСреднегоЗаработкаСЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрацииЗапросовСреднегоЗаработкаСЭДО</name>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоставкаТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибкиЛогическогоКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Зарегистрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрацияСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрацияДокумент</name>
    <type>
      <types>DocumentRef.СреднийЗаработокСЭДО</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияХранилищеXML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументаСЭДОФСС</types>
    </type>
  </resources>
  <resources>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияСНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтправленОператору</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправкиОператору</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистрацияПротокол</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиЛогическогоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИсходящийДокумент</name>
    <type>
      <types>DocumentRef.ЗапросСреднегоЗаработкаСЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/РегистрацииЗапросовСреднегоЗаработкаСЭДО/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	Если Количество() = 0 Или РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.Состояние = СостояниеРегистрации(Запись);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СостояниеРегистрации(Запись)
	
	Если Не ЗначениеЗаполнено(Запись.ДатаОтправки) И Не ЗначениеЗаполнено(Запись.ДатаОтправкиОператору) Тогда
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.ПустаяСсылка(); // Не отправлен.
		
	ИначеЕсли ЗначениеЗаполнено(Запись.ДоставкаТекстОшибки) Тогда
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.ОшибкаПриОтправке; // Ошибка при отправке.
		
	ИначеЕсли Запись.ЕстьОшибкиЛогическогоКонтроля Тогда
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.ОшибкаЛогическогоКонтроля; // Отправлен, получены ошибки.
		
	ИначеЕсли Запись.Зарегистрирован Тогда
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.Принят;
		
	ИначеЕсли ВРег(Запись.РегистрацияСтатус) = "RECEIVED" Тогда
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.Отправлен; // Отправлен, но не зарегистрирован.
		
	ИначеЕсли ВРег(Запись.РегистрацияСтатус) = "ERROR" Тогда
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.НеПринят; // Отправлен, но не зарегистрирован.
		
	ИначеЕсли Запись.ОтправленОператору И Не Запись.Доставлен Тогда
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.ОтправленОператору; // Передан оператору для доставки.
		
	Иначе
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.Отправлен; // Отправлен - заполнена дата отправка, нет информации о статусе.
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти



#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
